In [1]:
import pandas as pd

In [2]:
df_weather = pd.read_csv("weather.csv")

In [3]:
df_weather.shape

(16743, 14)

In [4]:
df_weather.head()

,Data.Precipitation,Date.Full,Date.Month,Date.Week of,Date.Year,Station.City,Station.Code,Station.Location,Station.State,Data.Temperature.Avg Temp,Data.Temperature.Max Temp,Data.Temperature.Min Temp,Data.Wind.Direction,Data.Wind.Speed
0,0.00,2016-01-03,1,3,2016,Birmingham,BHM,"Birmingham, AL",Alabama,39,46,32,33,4.33
1,0.00,2016-01-03,1,3,2016,Huntsville,HSV,"Huntsville, AL",Alabama,39,47,31,32,3.86
2,0.16,2016-01-03,1,3,2016,Mobile,MOB,"Mobile, AL",Alabama,46,51,41,35,9.73
3,0.00,2016-01-03,1,3,2016,Montgomery,MGM,"Montgomery, AL",Alabama,45,52,38,32,6.86
4,0.01,2016-01-03,1,3,2016,Anchorage,ANC,"Anchorage, AK",Alaska,34,38,29,19,7.80

In [6]:
unique_years = df_weather['Date.Year'].unique()

# Imprimir los valores Ãºnicos
print(unique_years)

[2016 2017]

In [8]:
df_weather2 = pd.read_csv("city_temperature.csv")

C:\Users\joseg\AppData\Local\Temp\ipykernel_17212\1443197202.py:1: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  df_weather2 = pd.read_csv("city_temperature.csv")

In [12]:
df_weather2.shape

(2906327, 8)

In [13]:
df_weather2.head()

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

In [14]:
uni_years = df_weather2['Year'].unique()

# Imprimir los valores Ãºnicos
print(uni_years)

[1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008
 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020  201  200]

In [16]:
uni_city = df_weather2['City'].unique()

# Imprimir los valores Ãºnicos
print(uni_city)

['Algiers' 'Bujumbura' 'Cotonou' 'Bangui' 'Brazzaville' 'Cairo'
 'Addis Ababa' 'Libreville' 'Banjul' 'Conakry' 'Bissau' 'Abidjan'
 'Nairobi' 'Rabat' 'Antananarivo' 'Nouakchott' 'Lilongwe' 'Maputo'
 'Windhoek' 'Niamey' 'Lagos' 'Dakar' 'Freetown' 'Capetown' 'Lome' 'Tunis'
 'Dar Es Salaam' 'Kampala' 'Lusaka' 'Dhaka' 'Beijing' 'Chengdu'
 'Guangzhou' 'Shanghai' 'Shenyang' 'Hong Kong' 'Bombay (Mumbai)'
 'Calcutta' 'Chennai (Madras)' 'Delhi' 'Jakarta' 'Osaka' 'Sapporo' 'Tokyo'
 'Almaty' 'Bishkek' 'Vientiane' 'Kuala Lumpur' 'Ulan-bator' 'Rangoon'
 'Katmandu' 'Pyongyang' 'Islamabad' 'Karachi' 'Manila' 'Singapore' 'Seoul'
 'Colombo' 'Taipei' 'Dusanbe' 'Bangkok' 'Ashabad' 'Tashkent' 'Hanoi'
 'Brisbane' 'Canberra' 'Melbourne' 'Perth' 'Sydney' 'Auckland' 'Tirana'
 'Vienna' 'Minsk' 'Brussels' 'Sofia' 'Zagreb' 'Nicosia' 'Prague'
 'Copenhagen' 'Helsinki' 'Paris' 'Bordeaux' 'Bonn' 'Frankfurt' 'Hamburg'
 'Munich' 'Tbilisi' 'Athens' 'Budapest' 'Reykjavik' 'Dublin' 'Milan'
 'Rome' 'Riga' 'Skopje' 'Amsterdam' 'Oslo' 'Warsaw' 'Lisbon' 'Bucharest'
 'Moscow' 'Yerevan' 'Pristina' 'Bratislava' 'Barcelona' 'Bilbao' 'Madrid'
 'Stockholm' 'Bern' 'Geneva' 'Zurich' 'Kiev' 'Belfast' 'London' 'Belgrade'
 'Manama' 'Tel Aviv' 'Amman' 'Kuwait' 'Beirut' 'Muscat' 'Doha' 'Dhahran'
 'Riyadh' 'Damascus' 'Ankara' 'Istanbul' 'Abu Dhabi' 'Dubai' 'Calgary'
 'Edmonton' 'Halifax' 'Montreal' 'Ottawa' 'Quebec' 'Regina' 'Toronto'
 'Vancouver' 'Winnipeg' 'Guadalajara' 'Mexico City' 'Monterrey'
 'Buenos Aires' 'Nassau' 'Hamilton' 'Belize City' 'La Paz' 'Bridgetown'
 'Brasilia' 'Rio de Janeiro' 'Sao Paulo' 'Bogota' 'San Jose' 'Havana'
 'Santo Domingo' 'Guayaquil' 'Quito' 'Guatemala City' 'Georgetown'
 'Port au Prince' 'Tegucigalpa' 'Managua' 'Panama City' 'Lima'
 'Paramaribo' 'Montvideo' 'Caracas' 'Birmingham' 'Huntsville' 'Mobile'
 'Montgomery' 'Anchorage' 'Fairbanks' 'Juneau' 'Flagstaff' 'Phoenix'
 'Tucson' 'Yuma' 'Fort Smith' 'Little Rock' 'Fresno' 'Los Angeles'
 'Sacramento' 'San Diego' 'San Francisco' 'Colorado Springs' 'Denver'
 'Grand Junction' 'Pueblo' 'Bridgeport' 'Hartford Springfield'
 'Wilmington' 'Washington' 'Washington DC' 'Daytona Beach' 'Jacksonville'
 'Miami Beach' 'Orlando' 'Tallahassee' 'Tampa St. Petersburg'
 'West Palm Beach' 'Atlanta' 'Columbus' 'Macon' 'Savannah' 'Honolulu'
 'Boise' 'Pocatello' 'Chicago' 'Peoria' 'Rockford' 'Springfield'
 'Evansville' 'Fort Wayne' 'Indianapolis' 'South Bend' 'Des Moines'
 'Sioux City' 'Goodland' 'Topeka' 'Wichita' 'Lexington' 'Louisville'
 'Paducah' 'Baton Rouge' 'Lake Charles' 'New Orleans' 'Shreveport'
 'Caribou' 'Portland' 'Baltimore' 'Boston' 'Detroit' 'Flint'
 'Grand Rapids' 'Lansing' 'Sault Ste Marie' 'Duluth'
 'Minneapolis St. Paul' 'Jackson' 'Tupelo' 'Kansas City' 'St Louis'
 'Billings' 'Great Falls' 'Helena' 'Lincoln' 'North Platte' 'Omaha' 'Reno'
 'Las Vegas' 'Concord' 'Atlantic City' 'Newark' 'Albuquerque' 'Albany'
 'Buffalo' 'New York City' 'Rochester' 'Syracuse' 'Asheville' 'Charlotte'
 'Greensboro' 'Raleigh Durham' 'Bismarck' 'Fargo' 'Akron Canton'
 'Cincinnati' 'Cleveland' 'Dayton' 'Toledo' 'Youngstown' 'Oklahoma City'
 'Tulsa' 'Eugene' 'Medford' 'Salem' 'Allentown' 'Erie' 'Harrisburg'
 'Philadelphia' 'Pittsburgh' 'Wilkes Barre' 'Rhode Island' 'Charleston'
 'Columbia' 'Rapid City' 'Sioux Falls' 'Chattanooga' 'Knoxville' 'Memphis'
 'Nashville' 'Abilene' 'Amarillo' 'Austin' 'Brownsville' 'Corpus Christi'
 'Dallas Ft Worth' 'El Paso' 'Houston' 'Lubbock' 'Midland Odessa'
 'San Angelo' 'San Antonio' 'Waco' 'Wichita Falls' 'Salt Lake City'
 'Burlington' 'Norfolk' 'Richmond' 'Roanoke' 'Seattle' 'Spokane' 'Yakima'
 'Elkins' 'Green Bay' 'Madison' 'Milwaukee' 'Casper' 'Cheyenne'
 'San Juan Puerto Rico']

In [18]:
ciudades_principales = ['ParÃ­s', 'Madrid', 'Nueva York', 'PekÃ­n', 'Roma', 'Estambul', 'Ciudad de MÃ©xico', 'BerlÃ­n', 'Londres']

# Filtrar el DataFrame df_weather2 utilizando la columna 'City'
df_filtrado = df_weather2[df_weather2['City'].isin(ciudades_principales)]

# Mostrar el DataFrame filtrado
print(df_filtrado)

        Region Country State    City  Month  Day  Year  AvgTemperature
921973  Europe   Spain   NaN  Madrid      1    1  1995            45.9
921974  Europe   Spain   NaN  Madrid      1    2  1995            40.0
921975  Europe   Spain   NaN  Madrid      1    3  1995            34.1
921976  Europe   Spain   NaN  Madrid      1    4  1995            37.0
921977  Europe   Spain   NaN  Madrid      1    5  1995            43.1
...        ...     ...   ...     ...    ...  ...   ...             ...
931234  Europe   Spain   NaN  Madrid      5    9  2020            67.0
931235  Europe   Spain   NaN  Madrid      5   10  2020            60.1
931236  Europe   Spain   NaN  Madrid      5   11  2020            60.6
931237  Europe   Spain   NaN  Madrid      5   12  2020            55.3
931238  Europe   Spain   NaN  Madrid      5   13  2020            51.7

[9266 rows x 8 columns]

In [20]:
df_filtrado.head()

        Region Country State    City  Month  Day  Year  AvgTemperature
921973  Europe   Spain   NaN  Madrid      1    1  1995            45.9
921974  Europe   Spain   NaN  Madrid      1    2  1995            40.0
921975  Europe   Spain   NaN  Madrid      1    3  1995            34.1
921976  Europe   Spain   NaN  Madrid      1    4  1995            37.0
921977  Europe   Spain   NaN  Madrid      1    5  1995            43.1